src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <comment>(ВКМ) ДОБАВЛЕНИЕ, Самжилин Д.Р., 06.08.2026</comment>
  <registerRecords>AccumulationRegister.ВКМ_НачислениеОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресВХ") Тогда
		
		МассивСтрок = ПолучитьИзВременногоХранилища(Параметры.АдресВХ);
		
		Если ТипЗнч(МассивСтрок) = Тип("Массив") Тогда
			
			Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
			Диаграмма.УстановитьПолныйИнтервал(НачалоГода(Параметры.Дата), КонецГода(Параметры.Дата));
			
			Элемент = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы[0];
			Элемент.Единица = ТипЕдиницыШкалыВремени.Год;
			Элемент.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Сплошная, 1);
			Элемент.Формат = "ДФ=yyyy;";
			
			НовЭлемент = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
			НовЭлемент.Единица = ТипЕдиницыШкалыВремени.Месяц;
			НовЭлемент.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Сплошная, 1);
			НовЭлемент.Формат = "ДФ=MMM;";
			
			Для Каждого Строка Из МассивСтрок Цикл
				
				Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
				Точка.Текст = Строка.Сотрудник;
				Серия = Диаграмма.УстановитьСерию("Отпуск");
				Серия.Текст = "Отпуск";
				Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
				
				Интервал = Значение.Добавить();
				
				Интервал.Начало = Строка.ДатаНачала;
				Интервал.Конец = Строка.ДатаОкончания;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Диаграмма.Обновление = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
